Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_and_work/part_time_job_incentive_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Part-Time Job Incentive Scheme
ga: An Scéim Dhreasachta Poist Pháirtaimseartha

source: The Part-Time Job Incentive (PTJI) Scheme allows certain people getting Jobseeker’s Allowance (JA) to take up part-time work and get a special weekly allowance instead of their jobseeker’s payment
ga: Tugann an Scéim Dhreasachta Poist Pháirtaimseartha (SDPP) deis do dhaoine áirithe atá ag fáil Liúntas Cuardaitheora Poist (LCP) glacadh le hobair lánaimseartha agus liúntas speisialta seachtainiúil a fháil in áit na híocaíochta cuardaitheora poist

source: It is intended to be a stepping stone to full-time work
ga: Tá sí beartaithe mar chloch chora i dtreo na hoibre lánaimseartha

source: You must be available for and seeking full-time work while you are on the Part-Time Job Incentive Scheme
ga: Ní mór duit bheith ar fáil d’obair lánaimseartha agus bheith ag lorg obair lánaimseartha fad is atá tú páirteach sa Scéim Dhreasachta Poist Pháirtaimseartha

source: You can participate in the PTJI Scheme if you get part-time work for less than 24 hours per week and immediately before that you were:
ga: Is féidir leat páirt a ghlacadh sa Scéim DPP má dhéanann tú obair pháirtaimseartha ar feadh níos lú ná 24 uair in aghaidh na seachtaine agus má bhí tú i gceachtar den dá chás seo a leanas díreach roimhe sin:

source: • On long-term Jobseeker’s Allowance (JA) for at least 390 days (15 months)
ga: • Ag fáil Liúntas Cuardaitheora Poist (LCP) ar bhonn fadtéarmach ar feadh 390 lá (15 mhí) ar a laghad

source: Days of unemployment on Jobseeker's Benefit (JB) count towards the 390 days if you were getting JB immediately before you got Jobseeker’s Allowance
ga: Cuirtear laethanta dífhostaíochta agus tú ag fáil Liúntas Cuardaitheora Poist (LCP) san áireamh sna 390 lá má bhí tú ag fáil LCP díreach sula bhfuair tú Sochar Cuardaitheora Poist

source: • Getting a weekly JA payment of at least €122.20 if you are single or €199.20 if you are getting an increase for a qualified adult. People who were getting One-Parent Family Payment and have moved to Jobseeker’s Allowance because their youngest child has reached the age limit can take part in the PTJI scheme
ga: • Ag fáil íocaíocht sheachtainiúil Chuardaitheora Poist ar luach €122.20 ar a laghad má tá tú singil nó ar luach €199.20 ar a laghad má tá tú ag fáil méadú do dhuine fásta cáilithe

source: You must also undertake to remain on the scheme for 2 months
ga: Is gá duit gealladh freisin go bhfanfaidh tú sa scéim ar feadh 2 mhí

source: You can do more than one part-time job but the total hours worked must be less than 24
ga: Is féidir leat níos mó ná post páirtaimseartha amháin a dhéanamh ach ní féidir leat obair a dhéanamh ar feadh níos mó ná 24 uair san iomlán

source: The part-time job you get must be likely to last at least 2 months and be insurable at PRSI Class A or J
ga: Ní mór gur dóchúil go mairfidh an post páirtaimseartha a fhaigheann tú ar feadh 2 mhí ar a laghad agus go bhfuil sé inárachais in Aicme ÁSPC A nó J

source: If you get full-time work you may not return to the PTJI Scheme at the end of your full-time work no matter how short it was
ga: Má fhaigheann tú obair lánaimseartha, níl cead agat filleadh ar an Scéim DPP ag deireadh d’oibre lánaimseartha, beag beann ar a ghiorra a bhí d'obair lánaimseartha

source: Self-employed people are not eligible for this scheme
ga: Níl daoine féinfhostaithe cáilithe le haghaidh na scéime seo

source: Initially, you can stay on the PTJI scheme for one year
ga: I dtosach, is ceadmhach fanacht sa Scéim DPP ar feadh bliain amháin

source: This may be extended for a further period
ga: D'fhéadfaí é sin a shíneadh ar feadh tréimhse níos faide

source: While on the scheme, you must continue to look for full-time work
ga: Agus tú páirteach sa scéim, ba cheart duit leanúint le hobair lánaimseartha a lorg

source: Instead of your usual payment, you will get a weekly allowance of:
ga: In ionad do ghnáthíocaíochta fostaíochta, gheobhaidh tú an liúntas seachtainiúil seo a leanas:

source: • €122.20 per week if you are single
ga: • €122.20 in aghaidh na seachtaine má tá tú singil

source: • €199.20 per week if you are getting an increase for a qualified adult
ga: • €199.20 in aghaidh na seachtaine má fhaigheann tú méadú do dhuine fásta cáilithe

source: There are no increases in these rates for qualified children
ga: Níl aon mhéaduithe ar na rátaí sin do leanaí cáilithe

source: The allowance is paid regardless of how much you earn in your job
ga: Íoctar an liúntas beag beann ar an airgead a thuilleann tú i do phost

source: However, your wages will be taxable in the usual way
ga: Ach beidh do phá incháinithe mar is gnách

source: If you have children and work over 19 hours a week (or 38 hours a fortnight) you can also apply for Family Income Supplement
ga: Má tá leanaí agat agus má oibríonn tú níos mó ná 19 uair in aghaidh na seachtaine (nó 38 uair in aghaidh na coicíse), is féidir leat iarratas a dhéanamh ar Fhorlíonadh Ioncaim Teaghlaigh freisin

source: Once you have secured the part-time job, you should contact your Intreo Centre or local Social Welfare Branch Office to apply for the PTJI scheme
ga: Nuair a bheidh an post páirtaimseartha faighte agat, ba cheart duit teagmháil a dhéanamh le d'oifig áitiúil leasa shóisialaigh nó le hionad áitiúil Intreo chun iarratas a dhéanamh ar an scéim DPP

source: You will be asked to complete the application form PTA 1 and give details of your part-time employment
ga: Iarrfar ort foirm iarratais PTA 1 a chomhlánú agus sonraí a thabhairt faoi d'fhostaíocht pháirtaimseartha

source: Your employer has to complete form PTJI2 at the end of each 4-week period to confirm the hours that you worked and that you are insurably employed
ga: Beidh ar d’fhostóir foirm PTJI2 a chomhlánú ag deireadh gach tréimhse 4 seachtaine chun a dheimhniú gur oibrigh tú agus go bhfuil tú ag gabháil d'fhostaíocht inárachais

source: You must sign a declaration (using the same form) confirming that you worked less than 24 hours each week
ga: Ní mór duit dearbhú a shíniú (ag úsáid an fhoirm chéanna) a dheimhníonn níos lú ná 24 uair oibrithe gach seachtain agat

source: You must return this form to your Intreo Centre or Social Welfare Branch Office
ga: Caithfidh tú an fhoirm seo cur ar ais chuig d’oifig áitiúil leasa shóisialaigh nó chuig ionad áitiúil Intreo

source: If there is any delay in returning this form, payment is suspended until the form is received
ga: Má tá aon mhoill chun an fhoirm a chur ar ais, cuirfear an íocaíocht ar fionraí go dtí go bhfaigheann an fhoirm

source: Payment is made weekly by EFT
ga: Déanann an íocaíocht tríd EFT

source: If your job ends or you finish the PTJI you may re-qualify for long-term Jobseeker’s Allowance as long as there is no change in your circumstances (other than finishing the part-time job)
ga: Má chríochnaíonn do phost nó má chríochnaíonn tú an scéim DPP, beidh tú cáilithe arís le haghaidh Liúntas Cuardaitheora Poist fadtéarmach, fad is nach bhfuil aon athrú ar do chúinsí (seachas an post páirtaimseartha a chríochnú)

source: Alternatively, you may qualify for Jobseeker’s Benefit if you have enough PRSI contributions
ga: Mar rogha eile, beidh tú cáilithe le haghaidh Sochar Cuardaitheora Poist má tá go leor ranníocaíochtaí ÁSPC agat

source: No secondary benefits are paid while you are on the Part-Time Job Incentive scheme
ga: Ní íoctar aon sochair thánaisteacha fad is atá tú páirteach sa scéim Dhreasachta Poist Pháirtaimseartha

source: You can keep your medical card while you are on the PTJI scheme regardless of your earnings for a maximum of 3 years
ga: Is féidir leat do chárta leighis a choinneáil ar feadh thréimhse na scéime DPP, beag beann ar do thuilleamh ar feadh tréimhse nach mó ná 3 bliana

source: You can continue to qualify for Rent Supplement but your earnings will be assessed against your supplement
ga: Leanfaidh tú le bheith cáilithe le haghaidh Forlíonadh Cíosa, ach déanfar do thuilleamh a mheasúnú in aghaidh d’fhorlíonta

source: The Part-Time Job Incentive scheme is a non-statutory scheme and you cannot appeal a decision to the Social Welfare Appeals Office
ga: Is scéim neamhreachtúil í an scéim Dhreasachta Poist Pháirtaimseartha agus ní féidir leat achomharc a dhéanamh chuig an Oifig Achomharc Leasa Shóisialaigh in aghaidh cinnidh

source: If you are not happy with a decision on the scheme you can appeal to the Officer in charge of the Part-Time Job Incentive Scheme at your social welfare local office
ga: Mura bhfuil tú sásta le cinneadh maidir leis an scéim, is féidir leat achomharc a dhéanamh chuig an Oifigeach atá i gceannas ar an Scéim Dhreasachta Poist Pháirtaimseartha ag d’oifig áitiúil leasa shóisialaigh

source: Apply to your local Intreo Centre or Social Welfare Branch Office
ga: Déan iarratas chuig d’oifig áitiúil leasa shóisialaigh nó chuig ionad áitiúil Intreo
